[
  {
    "times": ["Launch MEGATON. Done."],
    "texts": [
      "We will initiate the first phase by launching our investment offers through the TON Miner platform. This will provide users with an opportunity to invest in various liquidity pools and start earning daily interest income."
    ]
  },
  {
    "times": ["Social Network Pages. Done."],
    "texts": [
      "We will establish our presence on social media platforms such as Telegram, Twitter, and Instagram. This will help us to connect with our community, provide updates, and engage with potential investors."
    ]
  },
  {
    "times": ["Additional Games. Development."],
    "texts": [
      "We will develop additional games designed to double your profits. These games will incorporate unique mechanics to enhance your earnings and provide a fun, engaging experience."
    ]
  },
  {
    "times": ["Influencer Collaborations. Done."],   
    "texts": [
      "We will collaborate with influential figures in the cryptocurrency and investment communities to ensure broad participation and credibility. These collaborations will help in spreading awareness and attracting holders and participants to our MEGATON offer."
    ]
  },
  {
    "times": ["Landing Page. Development."],
    "texts": [
      "A professional landing page will be developed to present our investment offer. This page will serve as a central point for information, attracting potential investors and explaining the benefits of joining MEGATON Miner."
    ]
  },
  {
    "times": ["Fast Transactions. Done."],
    "texts": [
      "We aim to optimize our platform to support fast and efficient transactions, ensuring that users can quickly deposit, invest, and withdraw funds with minimal delay."
    ]
  },
  {
    "times": ["Providing liquidity. Development."],
    "texts": [
      "We will focus on ensuring the successful launch of liquidity provisions through cryptocurrency mining mechanisms. This step is crucial for maintaining a stable and profitable investment environment for our users."
    ]
  }
]
